In [33]:
import pandas as pd
import numpy as np

In [34]:
# create a dict
d={'name':['nirob','nipa','das'],
   'mark':[10,20,30],
   'city':['rampur','kolkata','portblair']
}

# craete a dataframe (2d array - data strcture) for analysis big data easily
df=pd.DataFrame(d)
df

    name  mark       city
0  nirob    10     rampur
1   nipa    20    kolkata
2    das    30  portblair

In [35]:
df.to_csv('pandas.csv')

In [36]:
# to remove index 

df.to_csv('without_pandas.csv',index=False)

In [37]:
df.head() # default first 5

    name  mark       city
0  nirob    10     rampur
1   nipa    20    kolkata
2    das    30  portblair

In [38]:
df.head(2)

    name  mark     city
0  nirob    10   rampur
1   nipa    20  kolkata

In [39]:
df.tail() # default last 5

    name  mark       city
0  nirob    10     rampur
1   nipa    20    kolkata
2    das    30  portblair

In [40]:
df.tail(2)

   name  mark       city
1  nipa    20    kolkata
2   das    30  portblair

In [41]:
df.describe() # it will show the numerical columns as it will shows the statics

       mark
count   3.0
mean   20.0
std    10.0
min    10.0
25%    15.0
50%    20.0
75%    25.0
max    30.0

In [44]:
# read any csv or excel file 
dff = pd.read_csv("newscsv.csv")
dff

   Train  speed       city
0   1234    100     rampur
1   2345    200    kolkata
2   3456    300  portblair

In [46]:
dff['speed']

0    100
1    200
2    300
Name: speed, dtype: int64

In [47]:
dff['speed'][0]=1000

C:\Users\Palak\AppData\Local\Temp/ipykernel_3436/2143414543.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dff['speed'][0]=1000

In [48]:
dff

   Train  speed       city
0   1234   1000     rampur
1   2345    200    kolkata
2   3456    300  portblair

In [49]:
dff.to_csv('newscsv.csv', index=False)   # write index =False if you want to remove index from file

In [50]:
dff.index

RangeIndex(start=0, stop=3, step=1)

In [53]:
dff.index=['a','b','c'] # to chande index value

In [67]:
dff

   Train  speed       city
a   1234   1000     rampur
b   2345    200    kolkata
c   3456    300  portblair

In [72]:
dff['speed']

a    1000
b     200
c     300
Name: speed, dtype: int64

In [68]:
c=0
for i in dff['speed']:
    c+=i

print(c)

1500

### Pandas Data Structure - it has 2 types of data structure -  

1. series - a single column of a dataframe represent a series  - 1d array and one column of same data type 
   like ---> dff['spped']
2. tabular like data structure - having multiple row and column - 2d array (data structure ) different columns
   holding different data types---- like --> dff ( combination of series is called df)

In [75]:
# create a series

In [95]:
s= pd.Series(np.random.rand(10))  # used numpy random function to generate random value of 10

In [96]:
s

0    0.404069
1    0.835562
2    0.375884
3    0.822491
4    0.626320
5    0.425986
6    0.178964
7    0.094496
8    0.966681
9    0.130283
dtype: float64

In [97]:
type(s)

pandas.core.series.Series

In [98]:
s[0]

0.40406942131995816

In [101]:
s[0]=10000

In [102]:
s

0    10000.000000
1        0.835562
2        0.375884
3        0.822491
4        0.626320
5        0.425986
6        0.178964
7        0.094496
8        0.966681
9        0.130283
dtype: float64

In [108]:
df=pd.DataFrame(np.random.rand(100,3), index=np.arange(100))

In [109]:
df

           0         1         2
0   0.954092  0.213853  0.851884
1   0.900218  0.184893  0.824074
2   0.223784  0.228672  0.225257
3   0.414460  0.174060  0.302561
4   0.316436  0.624186  0.577871
..       ...       ...       ...
95  0.541350  0.533964  0.627567
96  0.240765  0.911703  0.346679
97  0.483670  0.360860  0.362884
98  0.002886  0.257177  0.277426
99  0.837979  0.091162  0.828747

[100 rows x 3 columns]

In [110]:
df.head()

          0         1         2
0  0.954092  0.213853  0.851884
1  0.900218  0.184893  0.824074
2  0.223784  0.228672  0.225257
3  0.414460  0.174060  0.302561
4  0.316436  0.624186  0.577871

In [111]:
type(df)

pandas.core.frame.DataFrame

In [112]:
df.describe()

                0           1           2
count  100.000000  100.000000  100.000000
mean     0.487603    0.474291    0.513722
std      0.291448    0.307288    0.270967
min      0.002886    0.006395    0.033953
25%      0.250877    0.206042    0.276504
50%      0.457734    0.438311    0.518577
75%      0.782045    0.738730    0.747132
max      0.972897    0.995246    0.981619

In [116]:
df.head()

          0         1         2
0  0.954092  0.213853  0.851884
1  0.900218  0.184893  0.824074
2  0.223784  0.228672  0.225257
3  0.414460  0.174060  0.302561
4  0.316436  0.624186  0.577871

In [115]:
df.dtypes

0    float64
1    float64
2    float64
dtype: object

In [119]:
df[0][0]='niorb'

In [120]:
df

           0         1         2
0      niorb  0.213853  0.851884
1   0.900218  0.184893  0.824074
2   0.223784  0.228672  0.225257
3    0.41446  0.174060  0.302561
4   0.316436  0.624186  0.577871
..       ...       ...       ...
95   0.54135  0.533964  0.627567
96  0.240765  0.911703  0.346679
97   0.48367  0.360860  0.362884
98  0.002886  0.257177  0.277426
99  0.837979  0.091162  0.828747

[100 rows x 3 columns]

In [123]:
df.head()

          0         1         2
0     niorb  0.213853  0.851884
1  0.900218  0.184893  0.824074
2  0.223784  0.228672  0.225257
3   0.41446  0.174060  0.302561
4  0.316436  0.624186  0.577871

In [121]:
df.dtypes

0     object
1    float64
2    float64
dtype: object

In [127]:
df.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
            17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
            34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
            51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67,
            68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84,
            85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64')

In [128]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [132]:
numpy_array= df.to_numpy()
numpy_array

array([['niorb', 0.21385345867839645, 0.8518841326806627],
       [0.9002184058671218, 0.18489319776172852, 0.8240738216132224],
       [0.2237841321908095, 0.22867202451985158, 0.22525668809952581],
       [0.41446007792084016, 0.17405978945129885, 0.30256105993825977],
       [0.3164359621255304, 0.6241855581378133, 0.5778714917081686],
       [0.11323646966205125, 0.6536470348951374, 0.46907277033372785],
       [0.4273718667669377, 0.12493873302247904, 0.6770675286455407],
       [0.45995951025577364, 0.7384592776762041, 0.6634568834543492],
       [0.17067307484171357, 0.11098592283216957, 0.27677310999075244],
       [0.8089908094960985, 0.9865569790444066, 0.27569543529471374],
       [0.4931757692577623, 0.06639763353101247, 0.811807165603808],
       [0.4970865638672872, 0.057000297403249744, 0.9319810005315247],
       [0.6100494149502117, 0.265348827359835, 0.7954696146770307],
       [0.44584686692815956, 0.01700238770810303, 0.10169803528412913],
       [0.07548730066093545, 0.8689785745479579, 0.27348860322548874],
       [0.4089381418563004, 0.8815046203382372, 0.6276315663543202],
       [0.7990799921559801, 0.3155002981327192, 0.6796279575862768],
       [0.6260191968442065, 0.7223253220456501, 0.27108820703433156],
       [0.31436397006683336, 0.1979360711495396, 0.7864743220050379],
       [0.8488401431966773, 0.3818133433613743, 0.7439051457237729],
       [0.4095302114445539, 0.8134472054166819, 0.9221992203553666],
       [0.07340261099696044, 0.039517832213821324, 0.8707048260300974],
       [0.0434419052740036, 0.5894912078789257, 0.9588805239030828],
       [0.3777108650708991, 0.13994296441227094, 0.7593069148150726],
       [0.3364041167911642, 0.6848650251228635, 0.3102765127241739],
       [0.9298290252568194, 0.18215346126468313, 0.3708494856794623],
       [0.9122836589045623, 0.9323497723843562, 0.14236282545704781],
       [0.7500346707664082, 0.531619716999563, 0.5948018722849866],
       [0.12273611066979495, 0.6178594926740568, 0.30576518194792224],
       [0.8576294199873452, 0.624464268320909, 0.8705886359406505],
       [0.10523159926048409, 0.7395411210504458, 0.8401296717921775],
       [0.7036976961848631, 0.5080292886679759, 0.3612916093006523],
       [0.7207494192482746, 0.8831060125741674, 0.7127378882789398],
       [0.4555080456467002, 0.8482904323469308, 0.8540719802446166],
       [0.7212033583125792, 0.6301512752232551, 0.2449475077851525],
       [0.43434901953951655, 0.4975361547480982, 0.5796261454961374],
       [0.4195063996978725, 0.09218706402902721, 0.24635606180459269],
       [0.6311952569225623, 0.3327819612546947, 0.5207271650866452],
       [0.28168841888146545, 0.8781423955493713, 0.5640953037265819],
       [0.07067626268471272, 0.8830523908342888, 0.6991121873992536],
       [0.14381876651438585, 0.2085897931877969, 0.4877316474538841],
       [0.7751794630334681, 0.4077808009747702, 0.5946163024698621],
       [0.7820163804624524, 0.08769907959554835, 0.34134085128257674],
       [0.8711034527114003, 0.3837469799055605, 0.673177895100702],
       [0.3106156872199156, 0.8218797187644142, 0.7002055700659444],
       [0.5014282905657811, 0.9508585789883544, 0.5166618902558335],
       [0.8433917786929772, 0.4761848969982687, 0.22975583872594463],
       [0.82950522769623, 0.012777386971900118, 0.8672484220499994],
       [0.9728970742278581, 0.35588553379607946, 0.382141941404081],
       [0.2057772026187551, 0.22539863739098032, 0.9719899696368665],
       [0.5812584619974046, 0.3937042577408386, 0.4548889720425521],
       [0.657982751517314, 0.31099528604651316, 0.10000244645167577],
       [0.09505718465990554, 0.14488400541799218, 0.27457317889963506],
       [0.8529040439305181, 0.4207869787572287, 0.5999085620807784],
       [0.42038076866433116, 0.9559299948524818, 0.8106693238982798],
       [0.8492877343328097, 0.7572575817275102, 0.8215623442526407],
       [0.28721146299422673, 0.6383609203999605, 0.06122307305657959],
       [0.2992504318548722, 0.552103771254884, 0.05613012323876665],
       [0.49297834065486923, 0.42772818943757385, 0.5184029166923446],
       [0.057668622057514884, 0.5586974083214711, 0.03540697648714586],
       [0.3278348462297913, 0.19839727306140564, 0.04262779378362902],
       [0.8316058603252395, 0.10918558803599854, 0.03395250454262244],
       [0.9182048608657657, 0.2898214586457728, 0.9099294092724872],
       [0.5878103514280518, 0.6965399267280614, 0.3714682419052978],
       [0.06327596969729987, 0.01429984522181893, 0.24119751684427349],
       [0.30191981533232104, 0.06927363088234317, 0.5357921735669224],
       [0.5277330280340391, 0.967285251762876, 0.5766527405235092],
       [0.1888200222447658, 0.5983308056182103, 0.20837025141293497],
       [0.8210357851038717, 0.4488944529217199, 0.0941599822835022],
       [0.7676807925518873, 0.8562304766133642, 0.4157256659382883],
       [0.20638538747562318, 0.07126537427529822, 0.4265821789632699],
       [0.3012237780874838, 0.15290175144270268, 0.704265827439416],
       [0.295377712687121, 0.8388516486542666, 0.5187502693716202],
       [0.7557676648448735, 0.8528139759059638, 0.5121692675837621],
       [0.8944733070607725, 0.21906566226756596, 0.7296415483785761],
       [0.8732725775862124, 0.04665219564332024, 0.26870643933674865],
       [0.47654633208187347, 0.6872177839607932, 0.33590384912057747],
       [0.290496018894453, 0.2784807140416563, 0.7105079836629996],
       [0.8282979505998703, 0.008439151049895899, 0.35348310610678435],
       [0.6835763649318092, 0.9370546074107906, 0.44048939904485274],
       [0.0365864516492056, 0.3083195077332751, 0.23780368570660337],
       [0.8483355652470859, 0.9952460244813752, 0.9457452369614093],
       [0.18530981973166893, 0.9843934488564586, 0.9084613226456257],
       [0.6914619859926188, 0.5396435040682355, 0.7568120639373335],
       [0.08599041219993597, 0.8732982699125205, 0.3503314449183106],
       [0.7821323758697941, 0.4737495593416693, 0.5345468304799829],
       [0.7849997481527595, 0.3250549581019121, 0.9816189716459188],
       [0.0823026972212112, 0.8281061194385173, 0.7692559978416927],
       [0.2542481785110323, 0.33430852515127907, 0.5122748161158756],
       [0.16689112303108167, 0.5954721777088443, 0.8288304055754484],
       [0.06254807962757003, 0.26728181427705466, 0.7216043406564348],
       [0.4502398129022285, 0.006395333264802128, 0.04268921026751238],
       [0.02868997547768537, 0.6499556522311136, 0.24033793512455248],
       [0.29487258447816467, 0.9799202353606504, 0.15952936676305607],
       [0.8630692709521625, 0.4182911243135593, 0.11535005394464015],
       [0.541349733069021, 0.5339644498007329, 0.627566828854202],
       [0.24076543460230415, 0.9117031774837863, 0.3466787505707004],
       [0.48366959957964795, 0.3608600644488117, 0.36288443344998345],
       [0.002886445357973888, 0.25717690105176294, 0.2774263304048731],
       [0.837979169718434, 0.09116220016087018, 0.828746664101769]],
      dtype=object)

In [135]:
numpy_array[0]

array(['niorb', 0.21385345867839645, 0.8518841326806627], dtype=object)

In [136]:
numpy_array[0][0]

'niorb'

In [137]:
numpy_array[0][0]=1000

In [138]:
numpy_array

array([[1000, 0.21385345867839645, 0.8518841326806627],
       [0.9002184058671218, 0.18489319776172852, 0.8240738216132224],
       [0.2237841321908095, 0.22867202451985158, 0.22525668809952581],
       [0.41446007792084016, 0.17405978945129885, 0.30256105993825977],
       [0.3164359621255304, 0.6241855581378133, 0.5778714917081686],
       [0.11323646966205125, 0.6536470348951374, 0.46907277033372785],
       [0.4273718667669377, 0.12493873302247904, 0.6770675286455407],
       [0.45995951025577364, 0.7384592776762041, 0.6634568834543492],
       [0.17067307484171357, 0.11098592283216957, 0.27677310999075244],
       [0.8089908094960985, 0.9865569790444066, 0.27569543529471374],
       [0.4931757692577623, 0.06639763353101247, 0.811807165603808],
       [0.4970865638672872, 0.057000297403249744, 0.9319810005315247],
       [0.6100494149502117, 0.265348827359835, 0.7954696146770307],
       [0.44584686692815956, 0.01700238770810303, 0.10169803528412913],
       [0.07548730066093545, 0.8689785745479579, 0.27348860322548874],
       [0.4089381418563004, 0.8815046203382372, 0.6276315663543202],
       [0.7990799921559801, 0.3155002981327192, 0.6796279575862768],
       [0.6260191968442065, 0.7223253220456501, 0.27108820703433156],
       [0.31436397006683336, 0.1979360711495396, 0.7864743220050379],
       [0.8488401431966773, 0.3818133433613743, 0.7439051457237729],
       [0.4095302114445539, 0.8134472054166819, 0.9221992203553666],
       [0.07340261099696044, 0.039517832213821324, 0.8707048260300974],
       [0.0434419052740036, 0.5894912078789257, 0.9588805239030828],
       [0.3777108650708991, 0.13994296441227094, 0.7593069148150726],
       [0.3364041167911642, 0.6848650251228635, 0.3102765127241739],
       [0.9298290252568194, 0.18215346126468313, 0.3708494856794623],
       [0.9122836589045623, 0.9323497723843562, 0.14236282545704781],
       [0.7500346707664082, 0.531619716999563, 0.5948018722849866],
       [0.12273611066979495, 0.6178594926740568, 0.30576518194792224],
       [0.8576294199873452, 0.624464268320909, 0.8705886359406505],
       [0.10523159926048409, 0.7395411210504458, 0.8401296717921775],
       [0.7036976961848631, 0.5080292886679759, 0.3612916093006523],
       [0.7207494192482746, 0.8831060125741674, 0.7127378882789398],
       [0.4555080456467002, 0.8482904323469308, 0.8540719802446166],
       [0.7212033583125792, 0.6301512752232551, 0.2449475077851525],
       [0.43434901953951655, 0.4975361547480982, 0.5796261454961374],
       [0.4195063996978725, 0.09218706402902721, 0.24635606180459269],
       [0.6311952569225623, 0.3327819612546947, 0.5207271650866452],
       [0.28168841888146545, 0.8781423955493713, 0.5640953037265819],
       [0.07067626268471272, 0.8830523908342888, 0.6991121873992536],
       [0.14381876651438585, 0.2085897931877969, 0.4877316474538841],
       [0.7751794630334681, 0.4077808009747702, 0.5946163024698621],
       [0.7820163804624524, 0.08769907959554835, 0.34134085128257674],
       [0.8711034527114003, 0.3837469799055605, 0.673177895100702],
       [0.3106156872199156, 0.8218797187644142, 0.7002055700659444],
       [0.5014282905657811, 0.9508585789883544, 0.5166618902558335],
       [0.8433917786929772, 0.4761848969982687, 0.22975583872594463],
       [0.82950522769623, 0.012777386971900118, 0.8672484220499994],
       [0.9728970742278581, 0.35588553379607946, 0.382141941404081],
       [0.2057772026187551, 0.22539863739098032, 0.9719899696368665],
       [0.5812584619974046, 0.3937042577408386, 0.4548889720425521],
       [0.657982751517314, 0.31099528604651316, 0.10000244645167577],
       [0.09505718465990554, 0.14488400541799218, 0.27457317889963506],
       [0.8529040439305181, 0.4207869787572287, 0.5999085620807784],
       [0.42038076866433116, 0.9559299948524818, 0.8106693238982798],
       [0.8492877343328097, 0.7572575817275102, 0.8215623442526407],
       [0.28721146299422673, 0.6383609203999605, 0.06122307305657959],
       [0.2992504318548722, 0.552103771254884, 0.05613012323876665],
       [0.49297834065486923, 0.42772818943757385, 0.5184029166923446],
       [0.057668622057514884, 0.5586974083214711, 0.03540697648714586],
       [0.3278348462297913, 0.19839727306140564, 0.04262779378362902],
       [0.8316058603252395, 0.10918558803599854, 0.03395250454262244],
       [0.9182048608657657, 0.2898214586457728, 0.9099294092724872],
       [0.5878103514280518, 0.6965399267280614, 0.3714682419052978],
       [0.06327596969729987, 0.01429984522181893, 0.24119751684427349],
       [0.30191981533232104, 0.06927363088234317, 0.5357921735669224],
       [0.5277330280340391, 0.967285251762876, 0.5766527405235092],
       [0.1888200222447658, 0.5983308056182103, 0.20837025141293497],
       [0.8210357851038717, 0.4488944529217199, 0.0941599822835022],
       [0.7676807925518873, 0.8562304766133642, 0.4157256659382883],
       [0.20638538747562318, 0.07126537427529822, 0.4265821789632699],
       [0.3012237780874838, 0.15290175144270268, 0.704265827439416],
       [0.295377712687121, 0.8388516486542666, 0.5187502693716202],
       [0.7557676648448735, 0.8528139759059638, 0.5121692675837621],
       [0.8944733070607725, 0.21906566226756596, 0.7296415483785761],
       [0.8732725775862124, 0.04665219564332024, 0.26870643933674865],
       [0.47654633208187347, 0.6872177839607932, 0.33590384912057747],
       [0.290496018894453, 0.2784807140416563, 0.7105079836629996],
       [0.8282979505998703, 0.008439151049895899, 0.35348310610678435],
       [0.6835763649318092, 0.9370546074107906, 0.44048939904485274],
       [0.0365864516492056, 0.3083195077332751, 0.23780368570660337],
       [0.8483355652470859, 0.9952460244813752, 0.9457452369614093],
       [0.18530981973166893, 0.9843934488564586, 0.9084613226456257],
       [0.6914619859926188, 0.5396435040682355, 0.7568120639373335],
       [0.08599041219993597, 0.8732982699125205, 0.3503314449183106],
       [0.7821323758697941, 0.4737495593416693, 0.5345468304799829],
       [0.7849997481527595, 0.3250549581019121, 0.9816189716459188],
       [0.0823026972212112, 0.8281061194385173, 0.7692559978416927],
       [0.2542481785110323, 0.33430852515127907, 0.5122748161158756],
       [0.16689112303108167, 0.5954721777088443, 0.8288304055754484],
       [0.06254807962757003, 0.26728181427705466, 0.7216043406564348],
       [0.4502398129022285, 0.006395333264802128, 0.04268921026751238],
       [0.02868997547768537, 0.6499556522311136, 0.24033793512455248],
       [0.29487258447816467, 0.9799202353606504, 0.15952936676305607],
       [0.8630692709521625, 0.4182911243135593, 0.11535005394464015],
       [0.541349733069021, 0.5339644498007329, 0.627566828854202],
       [0.24076543460230415, 0.9117031774837863, 0.3466787505707004],
       [0.48366959957964795, 0.3608600644488117, 0.36288443344998345],
       [0.002886445357973888, 0.25717690105176294, 0.2774263304048731],
       [0.837979169718434, 0.09116220016087018, 0.828746664101769]],
      dtype=object)

In [140]:
df

           0         1         2
0      niorb  0.213853  0.851884
1   0.900218  0.184893  0.824074
2   0.223784  0.228672  0.225257
3    0.41446  0.174060  0.302561
4   0.316436  0.624186  0.577871
..       ...       ...       ...
95   0.54135  0.533964  0.627567
96  0.240765  0.911703  0.346679
97   0.48367  0.360860  0.362884
98  0.002886  0.257177  0.277426
99  0.837979  0.091162  0.828747

[100 rows x 3 columns]

In [142]:
df.T   # Transpose

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,niorb,0.900218,0.223784,0.41446,0.316436,0.113236,0.427372,0.45996,0.170673,0.808991,...,0.062548,0.45024,0.02869,0.294873,0.863069,0.54135,0.240765,0.48367,0.002886,0.837979
1,0.213853,0.184893,0.228672,0.17406,0.624186,0.653647,0.124939,0.738459,0.110986,0.986557,...,0.267282,0.006395,0.649956,0.97992,0.418291,0.533964,0.911703,0.36086,0.257177,0.091162
2,0.851884,0.824074,0.225257,0.302561,0.577871,0.469073,0.677068,0.663457,0.276773,0.275695,...,0.721604,0.042689,0.240338,0.159529,0.11535,0.627567,0.346679,0.362884,0.277426,0.828747

In [143]:
df.head()

          0         1         2
0     niorb  0.213853  0.851884
1  0.900218  0.184893  0.824074
2  0.223784  0.228672  0.225257
3   0.41446  0.174060  0.302561
4  0.316436  0.624186  0.577871

In [148]:
df.sort_index(ascending=False)

           0         1         2
99  0.837979  0.091162  0.828747
98  0.002886  0.257177  0.277426
97   0.48367  0.360860  0.362884
96  0.240765  0.911703  0.346679
95   0.54135  0.533964  0.627567
..       ...       ...       ...
4   0.316436  0.624186  0.577871
3    0.41446  0.174060  0.302561
2   0.223784  0.228672  0.225257
1   0.900218  0.184893  0.824074
0      niorb  0.213853  0.851884

[100 rows x 3 columns]

In [150]:
df.head()

          0         1         2
0     niorb  0.213853  0.851884
1  0.900218  0.184893  0.824074
2  0.223784  0.228672  0.225257
3   0.41446  0.174060  0.302561
4  0.316436  0.624186  0.577871

In [149]:
df[0]  # its a series

0        niorb
1     0.900218
2     0.223784
3      0.41446
4     0.316436
        ...
95     0.54135
96    0.240765
97     0.48367
98    0.002886
99    0.837979
Name: 0, Length: 100, dtype: object

In [151]:
type(df[0])

pandas.core.series.Series

In [152]:
# to copy

df1=df.copy()

In [160]:
df1.head()

          0         1         2
0     niorb  0.213853  0.851884
1  0.900218  0.184893  0.824074
2  0.223784  0.228672  0.225257
3   0.41446  0.174060  0.302561
4  0.316436  0.624186  0.577871

## to get row  and set value using row

In [156]:
df1.loc[0]

0       niorb
1    0.213853
2    0.851884
Name: 0, dtype: object

In [162]:
df1.loc[0,2]=100000

In [164]:
df1.head()

          0         1              2
0     niorb  0.213853  100000.000000
1  0.900218  0.184893       0.824074
2  0.223784  0.228672       0.225257
3   0.41446  0.174060       0.302561
4  0.316436  0.624186       0.577871

## set value using  column

In [167]:
df1[2]

0     100000.000000
1          0.824074
2          0.225257
3          0.302561
4          0.577871
          ...
95         0.627567
96         0.346679
97         0.362884
98         0.277426
99         0.828747
Name: 2, Length: 100, dtype: float64

In [168]:
df1[2][0]

100000.0

In [169]:
df1[2][0]=0.00

C:\Users\Palak\AppData\Local\Temp/ipykernel_3436/1122137896.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1[2][0]=0.00

In [170]:
df1.head()

          0         1         2
0     niorb  0.213853  0.000000
1  0.900218  0.184893  0.824074
2  0.223784  0.228672  0.225257
3   0.41446  0.174060  0.302561
4  0.316436  0.624186  0.577871

In [172]:
df1.columns=list('ABC')

In [173]:
df1.head(2)

          A         B         C
0     niorb  0.213853  0.000000
1  0.900218  0.184893  0.824074

In [191]:
df1.loc[0]

A       nirob
B    0.213853
C         0.0
Name: 0, dtype: object

In [198]:
df1.loc[0,'A']='nnn'

In [199]:
df1.head(2)

          A         B         C
0       nnn  0.213853  0.000000
1  0.900218  0.184893  0.824074

## To create a new column and rows

In [202]:
df1.head()

          A         B         C
0       nnn  0.213853  0.000000
1  0.900218  0.184893  0.824074
2  0.223784  0.228672  0.225257
3   0.41446  0.174060  0.302561
4  0.316436  0.624186  0.577871

In [209]:
df1['new col']='100'  # new columns using columns

In [210]:
df1.head()

          A         B         C new col
0       nnn  0.213853  0.000000     100
1  0.900218  0.184893  0.824074     100
2  0.223784  0.228672  0.225257     100
3   0.41446  0.174060  0.302561     100
4  0.316436  0.624186  0.577871     100

In [214]:
df1['new col']=list(range(100))

In [215]:
df1.head()

          A         B         C  new col
0       nnn  0.213853  0.000000        0
1  0.900218  0.184893  0.824074        1
2  0.223784  0.228672  0.225257        2
3   0.41446  0.174060  0.302561        3
4  0.316436  0.624186  0.577871        4

In [ ]:
# new columns using rows

In [223]:
df1.loc[0,'new col']

0

In [225]:
df1.loc[0,'new col']=100

In [226]:
df1.head()

          A         B         C  new col
0       nnn  0.213853  0.000000      100
1  0.900218  0.184893  0.824074        1
2  0.223784  0.228672  0.225257        2
3   0.41446  0.174060  0.302561        3
4  0.316436  0.624186  0.577871        4

In [235]:
df1.loc[0,'row column']=100   # create a new column

In [236]:
df1.head()

          A         B         C  new col  row column
0       nnn  0.213853  0.000000      100       100.0
1  0.900218  0.184893  0.824074        1         NaN
2  0.223784  0.228672  0.225257        2         NaN
3   0.41446  0.174060  0.302561        3         NaN
4  0.316436  0.624186  0.577871        4         NaN

In [237]:
del df1['row column']

In [238]:
df1.head()

          A         B         C  new col
0       nnn  0.213853  0.000000      100
1  0.900218  0.184893  0.824074        1
2  0.223784  0.228672  0.225257        2
3   0.41446  0.174060  0.302561        3
4  0.316436  0.624186  0.577871        4

In [239]:
df1.loc[0]  # first row at index 0

A               nnn
B          0.213853
C               0.0
new col         100
Name: 0, dtype: object

In [240]:
# change rows values 

df1.loc[0]=['new',10,20,30]

In [241]:
df1.head()

          A          B          C  new col
0       new  10.000000  20.000000       30
1  0.900218   0.184893   0.824074        1
2  0.223784   0.228672   0.225257        2
3   0.41446   0.174060   0.302561        3
4  0.316436   0.624186   0.577871        4

In [246]:
df1.dtypes

A           object
B          float64
C          float64
new col      int64
dtype: object

In [249]:
df1.drop(axis=1, columns='new col', inplace=True)

In [250]:
df1

           A          B          C
0        new  10.000000  20.000000
1   0.900218   0.184893   0.824074
2   0.223784   0.228672   0.225257
3    0.41446   0.174060   0.302561
4   0.316436   0.624186   0.577871
..       ...        ...        ...
95   0.54135   0.533964   0.627567
96  0.240765   0.911703   0.346679
97   0.48367   0.360860   0.362884
98  0.002886   0.257177   0.277426
99  0.837979   0.091162   0.828747

[100 rows x 3 columns]

# To get some row and columns

In [251]:
df1.head()

          A          B          C
0       new  10.000000  20.000000
1  0.900218   0.184893   0.824074
2  0.223784   0.228672   0.225257
3   0.41446   0.174060   0.302561
4  0.316436   0.624186   0.577871

In [255]:
df1.loc[0]

A     new
B    10.0
C    20.0
Name: 0, dtype: object

In [254]:
df1.loc[0,'A']

'new'

In [256]:
df1.loc[[0,1,2]]

          A          B          C
0       new  10.000000  20.000000
1  0.900218   0.184893   0.824074
2  0.223784   0.228672   0.225257

In [257]:
df1.loc[[0,1,2],['B','C']]

           B          C
0  10.000000  20.000000
1   0.184893   0.824074
2   0.228672   0.225257

In [258]:
df1.loc[:,['B','C']]

            B          C
0   10.000000  20.000000
1    0.184893   0.824074
2    0.228672   0.225257
3    0.174060   0.302561
4    0.624186   0.577871
..        ...        ...
95   0.533964   0.627567
96   0.911703   0.346679
97   0.360860   0.362884
98   0.257177   0.277426
99   0.091162   0.828747

[100 rows x 2 columns]

In [259]:
df1.loc[[0,1,2],:]

          A          B          C
0       new  10.000000  20.000000
1  0.900218   0.184893   0.824074
2  0.223784   0.228672   0.225257

In [270]:
df1['B']>0.98

0      True
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Name: B, Length: 100, dtype: bool

In [275]:
df1.loc[df1['B']>0.98]

           A          B          C
0        new  10.000000  20.000000
9   0.808991   0.986557   0.275695
81  0.848336   0.995246   0.945745
82   0.18531   0.984393   0.908461

In [279]:
df1.loc[df1['B']>0.98,['B','C']]

            B          C
0   10.000000  20.000000
9    0.986557   0.275695
81   0.995246   0.945745
82   0.984393   0.908461

In [280]:
df1.loc[df1['B']>0.98,:]

           A          B          C
0        new  10.000000  20.000000
9   0.808991   0.986557   0.275695
81  0.848336   0.995246   0.945745
82   0.18531   0.984393   0.908461

In [283]:
df1.loc[((df1['B']>0.98) & (df1['C']>0.90))]

           A          B          C
0        new  10.000000  20.000000
81  0.848336   0.995246   0.945745
82   0.18531   0.984393   0.908461

In [284]:
df1.loc[((df1['B']>0.98) & (df1['C']>0.90)),['B','C']]

            B          C
0   10.000000  20.000000
81   0.995246   0.945745
82   0.984393   0.908461

### WHEN TO COUNT FROM INDEX - USE ILOC

In [286]:
df1.head(3)

          A          B          C
0       new  10.000000  20.000000
1  0.900218   0.184893   0.824074
2  0.223784   0.228672   0.225257

In [291]:
df1.loc[0]

A     new
B    10.0
C    20.0
Name: 0, dtype: object

In [294]:
df1.loc[0,'C']

20.0

In [292]:
df1.iloc[0]

A     new
B    10.0
C    20.0
Name: 0, dtype: object

In [295]:
df1.iloc[0,2]  # rowwise index number

20.0

In [301]:
df1.head()

          A          B          C
0       new  10.000000  20.000000
1  0.900218   0.184893   0.824074
2  0.223784   0.228672   0.225257
3   0.41446   0.174060   0.302561
4  0.316436   0.624186   0.577871

In [309]:
df1.iloc[[0,1]]

          A          B          C
0       new  10.000000  20.000000
1  0.900218   0.184893   0.824074

In [306]:
df1.iloc[[0,1],[1,2]]

           B          C
0  10.000000  20.000000
1   0.184893   0.824074

In [311]:
df1.iloc[[0,3],[0,2]]

         A          C
0      new  20.000000
3  0.41446   0.302561

In [313]:
df1.head()

          A          B          C
0       new  10.000000  20.000000
1  0.900218   0.184893   0.824074
2  0.223784   0.228672   0.225257
3   0.41446   0.174060   0.302561
4  0.316436   0.624186   0.577871

In [316]:
df1.loc[0]

A     new
B    10.0
C    20.0
Name: 0, dtype: object

In [320]:
df1.drop(axis=0, index=1, inplace=True)

In [321]:
df1.head()

          A          B          C
0       new  10.000000  20.000000
2  0.223784   0.228672   0.225257
3   0.41446   0.174060   0.302561
4  0.316436   0.624186   0.577871
5  0.113236   0.653647   0.469073

In [322]:
df1.drop([0])

           A         B         C
2   0.223784  0.228672  0.225257
3    0.41446  0.174060  0.302561
4   0.316436  0.624186  0.577871
5   0.113236  0.653647  0.469073
6   0.427372  0.124939  0.677068
..       ...       ...       ...
95   0.54135  0.533964  0.627567
96  0.240765  0.911703  0.346679
97   0.48367  0.360860  0.362884
98  0.002886  0.257177  0.277426
99  0.837979  0.091162  0.828747

[98 rows x 3 columns]

In [325]:
df1.drop(['A','C'], axis=1)

            B
0   10.000000
2    0.228672
3    0.174060
4    0.624186
5    0.653647
..        ...
95   0.533964
96   0.911703
97   0.360860
98   0.257177
99   0.091162

[99 rows x 1 columns]

In [326]:
df1.head()

          A          B          C
0       new  10.000000  20.000000
2  0.223784   0.228672   0.225257
3   0.41446   0.174060   0.302561
4  0.316436   0.624186   0.577871
5  0.113236   0.653647   0.469073

In [327]:
df1.drop(columns=['A','C'], axis=1)

            B
0   10.000000
2    0.228672
3    0.174060
4    0.624186
5    0.653647
..        ...
95   0.533964
96   0.911703
97   0.360860
98   0.257177
99   0.091162

[99 rows x 1 columns]

In [328]:
df1.drop(columns='A', axis=1)

            B          C
0   10.000000  20.000000
2    0.228672   0.225257
3    0.174060   0.302561
4    0.624186   0.577871
5    0.653647   0.469073
..        ...        ...
95   0.533964   0.627567
96   0.911703   0.346679
97   0.360860   0.362884
98   0.257177   0.277426
99   0.091162   0.828747

[99 rows x 2 columns]

In [330]:
df1.drop([0,2],axis=0)

           A         B         C
3    0.41446  0.174060  0.302561
4   0.316436  0.624186  0.577871
5   0.113236  0.653647  0.469073
6   0.427372  0.124939  0.677068
7    0.45996  0.738459  0.663457
..       ...       ...       ...
95   0.54135  0.533964  0.627567
96  0.240765  0.911703  0.346679
97   0.48367  0.360860  0.362884
98  0.002886  0.257177  0.277426
99  0.837979  0.091162  0.828747

[97 rows x 3 columns]

In [331]:
# how to reset index

In [333]:
df1.head()

          A          B          C
0       new  10.000000  20.000000
2  0.223784   0.228672   0.225257
3   0.41446   0.174060   0.302561
4  0.316436   0.624186   0.577871
5  0.113236   0.653647   0.469073

In [334]:
df1.reset_index()

    index         A          B          C
0       0       new  10.000000  20.000000
1       2  0.223784   0.228672   0.225257
2       3   0.41446   0.174060   0.302561
3       4  0.316436   0.624186   0.577871
4       5  0.113236   0.653647   0.469073
..    ...       ...        ...        ...
94     95   0.54135   0.533964   0.627567
95     96  0.240765   0.911703   0.346679
96     97   0.48367   0.360860   0.362884
97     98  0.002886   0.257177   0.277426
98     99  0.837979   0.091162   0.828747

[99 rows x 4 columns]

In [348]:
df1.reset_index(drop=True, inplace=True)
df1

           A          B          C
0        new  10.000000  20.000000
1   0.223784   0.228672   0.225257
2    0.41446   0.174060   0.302561
3   0.316436   0.624186   0.577871
4   0.113236   0.653647   0.469073
..       ...        ...        ...
94   0.54135   0.533964   0.627567
95  0.240765   0.911703   0.346679
96   0.48367   0.360860   0.362884
97  0.002886   0.257177   0.277426
98  0.837979   0.091162   0.828747

[99 rows x 3 columns]

In [338]:
len(df1['C'])

99

In [339]:
df1['C']

0     20.000000
2      0.225257
3      0.302561
4      0.577871
5      0.469073
        ...
95     0.627567
96     0.346679
97     0.362884
98     0.277426
99     0.828747
Name: C, Length: 99, dtype: float64

In [350]:
df1.isnull().head()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [380]:
df1['A'].isnull()

0     False
1     False
2     False
3     False
4     False
      ...
93    False
94    False
95    False
96    False
97    False
Name: A, Length: 98, dtype: bool

In [352]:
df1.notnull().head()

      A     B     C
0  True  True  True
1  True  True  True
2  True  True  True
3  True  True  True
4  True  True  True

In [353]:
df1.head()

          A          B          C
0       new  10.000000  20.000000
1  0.223784   0.228672   0.225257
2   0.41446   0.174060   0.302561
3  0.316436   0.624186   0.577871
4  0.113236   0.653647   0.469073

In [356]:
df1['A'][0]=None

C:\Users\Palak\AppData\Local\Temp/ipykernel_3436/3040266703.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['A'][0]=None

In [362]:
df1

           A          B          C
0       None  10.000000  20.000000
1   0.223784   0.228672   0.225257
2    0.41446   0.174060   0.302561
3   0.316436   0.624186   0.577871
4   0.113236   0.653647   0.469073
..       ...        ...        ...
94   0.54135   0.533964   0.627567
95  0.240765   0.911703   0.346679
96   0.48367   0.360860   0.362884
97  0.002886   0.257177   0.277426
98  0.837979   0.091162   0.828747

[99 rows x 3 columns]

In [361]:
df1.dropna()

           A         B         C
1   0.223784  0.228672  0.225257
2    0.41446  0.174060  0.302561
3   0.316436  0.624186  0.577871
4   0.113236  0.653647  0.469073
5   0.427372  0.124939  0.677068
..       ...       ...       ...
94   0.54135  0.533964  0.627567
95  0.240765  0.911703  0.346679
96   0.48367  0.360860  0.362884
97  0.002886  0.257177  0.277426
98  0.837979  0.091162  0.828747

[98 rows x 3 columns]

In [365]:
df1['A'][1]=None

C:\Users\Palak\AppData\Local\Temp/ipykernel_3436/3444414575.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['A'][1]=None

In [366]:
df1.head()

          A          B          C
0      None  10.000000  20.000000
1      None   0.228672   0.225257
2   0.41446   0.174060   0.302561
3  0.316436   0.624186   0.577871
4  0.113236   0.653647   0.469073

In [368]:
df1.fillna(0)

           A          B          C
0   0.000000  10.000000  20.000000
1   0.000000   0.228672   0.225257
2   0.414460   0.174060   0.302561
3   0.316436   0.624186   0.577871
4   0.113236   0.653647   0.469073
..       ...        ...        ...
94  0.541350   0.533964   0.627567
95  0.240765   0.911703   0.346679
96  0.483670   0.360860   0.362884
97  0.002886   0.257177   0.277426
98  0.837979   0.091162   0.828747

[99 rows x 3 columns]

In [370]:
df1.loc[0]=[1,2,3]

In [371]:
df1.loc[1]=[1,2,3]

In [372]:
df1

           A         B         C
0          1  2.000000  3.000000
1          1  2.000000  3.000000
2    0.41446  0.174060  0.302561
3   0.316436  0.624186  0.577871
4   0.113236  0.653647  0.469073
..       ...       ...       ...
94   0.54135  0.533964  0.627567
95  0.240765  0.911703  0.346679
96   0.48367  0.360860  0.362884
97  0.002886  0.257177  0.277426
98  0.837979  0.091162  0.828747

[99 rows x 3 columns]

In [377]:
df1.drop_duplicates(inplace=True)
df1

           A         B         C
0          1  2.000000  3.000000
2    0.41446  0.174060  0.302561
3   0.316436  0.624186  0.577871
4   0.113236  0.653647  0.469073
5   0.427372  0.124939  0.677068
..       ...       ...       ...
94   0.54135  0.533964  0.627567
95  0.240765  0.911703  0.346679
96   0.48367  0.360860  0.362884
97  0.002886  0.257177  0.277426
98  0.837979  0.091162  0.828747

[98 rows x 3 columns]

In [378]:
df1.reset_index(drop=True, inplace=True)

In [379]:
df1

           A         B         C
0          1  2.000000  3.000000
1    0.41446  0.174060  0.302561
2   0.316436  0.624186  0.577871
3   0.113236  0.653647  0.469073
4   0.427372  0.124939  0.677068
..       ...       ...       ...
93   0.54135  0.533964  0.627567
94  0.240765  0.911703  0.346679
95   0.48367  0.360860  0.362884
96  0.002886  0.257177  0.277426
97  0.837979  0.091162  0.828747

[98 rows x 3 columns]

In [381]:
df1['B']

0     2.000000
1     0.174060
2     0.624186
3     0.653647
4     0.124939
        ...
93    0.533964
94    0.911703
95    0.360860
96    0.257177
97    0.091162
Name: B, Length: 98, dtype: float64

In [382]:
df1['B']=None

In [383]:
df1

           A     B         C
0          1  None  3.000000
1    0.41446  None  0.302561
2   0.316436  None  0.577871
3   0.113236  None  0.469073
4   0.427372  None  0.677068
..       ...   ...       ...
93   0.54135  None  0.627567
94  0.240765  None  0.346679
95   0.48367  None  0.362884
96  0.002886  None  0.277426
97  0.837979  None  0.828747

[98 rows x 3 columns]

In [387]:
df1.loc[[0,1],['B']]='100'

In [388]:
df1

           A     B         C
0          1   100  3.000000
1    0.41446   100  0.302561
2   0.316436  None  0.577871
3   0.113236  None  0.469073
4   0.427372  None  0.677068
..       ...   ...       ...
93   0.54135  None  0.627567
94  0.240765  None  0.346679
95   0.48367  None  0.362884
96  0.002886  None  0.277426
97  0.837979  None  0.828747

[98 rows x 3 columns]

In [389]:
df1.loc[[0,1],['B','C']]='100'

In [390]:
df1

           A     B         C
0          1   100       100
1    0.41446   100       100
2   0.316436  None  0.577871
3   0.113236  None  0.469073
4   0.427372  None  0.677068
..       ...   ...       ...
93   0.54135  None  0.627567
94  0.240765  None  0.346679
95   0.48367  None  0.362884
96  0.002886  None  0.277426
97  0.837979  None  0.828747

[98 rows x 3 columns]

In [391]:
df1.loc[:,['B','C']]='100'

In [392]:
df1

           A    B    C
0          1  100  100
1    0.41446  100  100
2   0.316436  100  100
3   0.113236  100  100
4   0.427372  100  100
..       ...  ...  ...
93   0.54135  100  100
94  0.240765  100  100
95   0.48367  100  100
96  0.002886  100  100
97  0.837979  100  100

[98 rows x 3 columns]

In [395]:
df1.loc[[0,1],:]='3--'

In [396]:
df1

           A    B    C
0        3--  3--  3--
1        3--  3--  3--
2   0.316436  100  100
3   0.113236  100  100
4   0.427372  100  100
..       ...  ...  ...
93   0.54135  100  100
94  0.240765  100  100
95   0.48367  100  100
96  0.002886  100  100
97  0.837979  100  100

[98 rows x 3 columns]

In [398]:
df1.shape

(98, 3)

In [399]:
df1.info

<bound method DataFrame.info of            A    B    C
0        3--  3--  3--
1        3--  3--  3--
2   0.316436  100  100
3   0.113236  100  100
4   0.427372  100  100
..       ...  ...  ...
93   0.54135  100  100
94  0.240765  100  100
95   0.48367  100  100
96  0.002886  100  100
97  0.837979  100  100

[98 rows x 3 columns]>

In [401]:
df1

           A    B    C
0        3--  3--  3--
1        3--  3--  3--
2   0.316436  100  100
3   0.113236  100  100
4   0.427372  100  100
..       ...  ...  ...
93   0.54135  100  100
94  0.240765  100  100
95   0.48367  100  100
96  0.002886  100  100
97  0.837979  100  100

[98 rows x 3 columns]

In [407]:
df1=pd.DataFrame({'name':['a','b','c'],'age':[1,2,None]})

In [408]:
df1

  name  age
0    a  1.0
1    b  2.0
2    c  NaN

In [411]:
df1['age'].value_counts(dropna=False)

1.0    1
2.0    1
NaN    1
Name: age, dtype: int64

In [412]:
df1['age'].value_counts(dropna=True)

1.0    1
2.0    1
Name: age, dtype: int64

In [413]:
df1['age'].value_counts()

1.0    1
2.0    1
Name: age, dtype: int64

In [414]:
df1['age'].value_counts(dropna=True)

a    1
b    1
c    1
Name: name, dtype: int64

In [415]:
df1['age'].value_counts(dropna=False)

1.0    1
2.0    1
NaN    1
Name: age, dtype: int64

In [416]:
df1.max()

name      c
age     2.0
dtype: object

In [417]:
df1.min()

name      a
age     1.0
dtype: object

In [418]:
df1.mean()

C:\Users\Palak\AppData\Local\Temp/ipykernel_3436/2053335143.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df1.mean()

age    1.5
dtype: float64

In [419]:
df1.describe()

            age
count  2.000000
mean   1.500000
std    0.707107
min    1.000000
25%    1.250000
50%    1.500000
75%    1.750000
max    2.000000

# how to read excel file

In [424]:
!pip install openpyxl  # as this module where not present to read excel file by pandas

Collecting openpyxl
  Downloading openpyxl-3.0.10-py2.py3-none-any.whl (242 kB)
     ------------------------------------ 242.1/242.1 kB 309.6 kB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.10

In [446]:
df2=pd.read_excel('excel data.xlsx')
df2

    name  speed       city
0  nirob     10  portblair
1   nipa     20   diglipur
2    nee     30       pune

In [447]:
df2.reset_index(drop=True)

    name  speed       city
0  nirob     10  portblair
1   nipa     20   diglipur
2    nee     30       pune

In [448]:
df2.index=list('ABC')

In [449]:
df2

    name  speed       city
A  nirob     10  portblair
B   nipa     20   diglipur
C    nee     30       pune

In [450]:
df2.columns=list('123')

In [451]:
df2

       1   2          3
A  nirob  10  portblair
B   nipa  20   diglipur
C    nee  30       pune

# read excel file of its multiple sheet like sheet1 , sheet2 etc.

In [458]:
df3= pd.read_excel("excel data.xlsx",sheet_name='Sheet1')

In [459]:
df3

    name  speed       city
0  nirob     10  portblair
1   nipa     20   diglipur
2    nee     30       pune

In [455]:
df3= pd.read_excel("excel data.xlsx",sheet_name='Sheet2')

In [456]:
df3

   alo   bin
0    1    10
1    2    20
2    3  None

# write excel file of its multiple sheet like sheet1 , sheet2 etc

In [470]:
df3

    name   speed       city
0  nirob  100000  portblair
1   nipa      20   diglipur
2    nee      30       pune

In [472]:
df3.iloc[0,1]='nirob'

In [473]:
df3

    name  speed       city
0  nirob  nirob  portblair
1   nipa     20   diglipur
2    nee     30       pune

In [475]:
df3.to_excel("excel data.xlsx",sheet_name='Sheet1', index=False)

In [477]:
df4= pd.read_excel("excel data.xlsx",sheet_name='Sheet1')

In [478]:
df4

    name  speed       city
0  nirob  nirob  portblair
1   nipa     20   diglipur
2    nee     30       pune

# various way to create pandas library

In [487]:
# create a dict
d={'name':['nirob','nipa','das'],
   'mark':[10,20,30],
   'city':['rampur','kolkata','portblair']
}

# craete a dataframe (2d array - data strcture) for analysis big data easily
df=pd.DataFrame(d)
df

    name  mark       city
0  nirob    10     rampur
1   nipa    20    kolkata
2    das    30  portblair

In [488]:
# create a dict
d={'name':['nirob','nipa','das'],
   'mark':[10,20,30],
   'city':['rampur','kolkata','portblair']
}

# craete a dataframe (2d array - data strcture) for analysis big data easily
df=pd.DataFrame(d, index=['100','200','300'])
df

      name  mark       city
100  nirob    10     rampur
200   nipa    20    kolkata
300    das    30  portblair

In [489]:
# create a dict
d={'name':['nirob','nipa','das'],
   'mark':[10,20,30],
   'city':['rampur','kolkata','portblair']
}

# craete a dataframe (2d array - data strcture) for analysis big data easily
df=pd.DataFrame(d, index= pd.Index(['100','200','300'], name='INDEX'))
df

        name  mark       city
INDEX
100    nirob    10     rampur
200     nipa    20    kolkata
300      das    30  portblair

In [491]:
# create a dict
d={'name':['nirob','nipa','das'],
   'mark':[10,20,30],
   'city':['rampur','kolkata','portblair']
}

# craete a dataframe (2d array - data strcture) for analysis big data easily
df=pd.DataFrame(d, index= pd.Index(['100','200','300'], name='INDEX'), columns=pd.Index(['name','mark','city'],name='COL'))
df

COL     name  mark       city
INDEX
100    nirob    10     rampur
200     nipa    20    kolkata
300      das    30  portblair